Revit 2024 API
InstanceNode Class
 An output node that represents an instance of a geometry. It can be an instance of FamilyInstance, or it can be and instance of a part of symbol's geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class InstanceNode : GroupNode
Visual Basic
Public Class InstanceNode _
	Inherits GroupNode
Visual C++
public ref class InstanceNode : public GroupNode
Remarks
 See also: [!:Autodesk::Revit::DB::IExportContext::OnInstanceBegin]. The SymbolGeometryId. contains the data for comparing if two InstanceNode points to the same geometry.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.InstanceNode
See Also
InstanceNode Members
Autodesk.Revit.DB Namespace